# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    print(f'{name}')


# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём
# Пример вывода:
# Оля: 3
# Петя: 4

names = ['Оля', 'Петя', 'Вася', 'Маша']
for name in names:
    dlina=len(name)
    print(f'{name} : {dlina} ')
   
# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
    'Оля': False,  # если False, то пол женский
    'Петя': True,  # если True, то пол мужской
    'Вася': True,
    'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша', 'Вася', 'Петя', 'Оля', 'Оля', 'Коля', 'Федор']
for name in names:	
	if name in is_male:		 
		gender='Мужчина' if is_male[name] is True else 'Женщина'
	if name not in is_male:	 
		gender='Не найден'
	print (name, " - ", gender)


# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# Группа 1: 2 ученика.
# Группа 2: 4 ученика.

groups = [
    ['Вася', 'Маша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
    ['Оля', 'Петя', 'Гриша'],
]
print("Всего", len(groups), "группы.")
for group_number, group in enumerate(groups, start=1):
	total_students=len(group)
	print(f'Группа {group_number}: {total_students} ученика')

# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят
# Пример вывода:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
    ['Вася', 'Маша'],
    ['Оля', 'Петя', 'Гриша'],
    ['Вася', 'Маша', 'Саша', 'Женя'],
]
for num_group in range(len(groups)):
  
    gr=f'Группа {num_group+1}:'
    print(gr, ', '.join(map(str,groups[num_group])))
    
    

















